app/controllers/movies_controller.rb

  def same_director
     id = params[:id]
     @movie = Movie.find(id)

      if @movie.director and !@movie.director.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'